In [101]:
import pandas as pd
import numpy as np

In [102]:
data = pd.read_csv("../Datasets/titanic/Train.csv")
dftest=pd.read_csv('../Datasets/titanic/Test/Test.csv')

In [103]:
data.head(n=5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.750,NaN,Q,NaN,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.000,NaN,S,NaN,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.000,NaN,S,9,NaN,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.525,NaN,S,C D,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.250,NaN,Q,16,NaN,NaN

In [104]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1009 non-null   float64
 1   survived   1009 non-null   float64
 2   name       1009 non-null   object
 3   sex        1009 non-null   object
 4   age        812 non-null    float64
 5   sibsp      1009 non-null   float64
 6   parch      1009 non-null   float64
 7   ticket     1009 non-null   object
 8   fare       1008 non-null   float64
 9   cabin      229 non-null    object
 10  embarked   1008 non-null   object
 11  boat       374 non-null    object
 12  body       98 non-null     float64
 13  home.dest  582 non-null    object
dtypes: float64(7), object(7)
memory usage: 110.5+ KB

In [105]:
print(data.columns)

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [106]:
columns_to_drop = ["name","ticket","cabin","embarked",'body','home.dest','boat']

In [107]:
data_clean = data.drop(columns_to_drop,axis=1)
dftest = dftest.drop(columns_to_drop,axis=1)

In [108]:
data_clean.head(n=5)

   pclass  survived     sex   age  sibsp  parch    fare
0     3.0       0.0  female   NaN    0.0    0.0   7.750
1     2.0       0.0    male  39.0    0.0    0.0  26.000
2     2.0       1.0  female  40.0    0.0    0.0  13.000
3     3.0       1.0  female  31.0    1.0    1.0  20.525
4     3.0       1.0  female   NaN    2.0    0.0  23.250

In [109]:
dftest.head()

   pclass     sex   age  sibsp  parch     fare
0     1.0    male  36.0    0.0    0.0  26.3875
1     3.0  female   NaN    8.0    2.0  69.5500
2     1.0    male   NaN    0.0    0.0  50.0000
3     2.0    male  34.0    0.0    0.0  13.0000
4     2.0    male  28.0    0.0    0.0  13.0000

In [110]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
data_clean["sex"] = le.fit_transform(data_clean["sex"])
dftest["sex"] = le.transform(dftest["sex"])

In [111]:
data_clean.head()

   pclass  survived  sex   age  sibsp  parch    fare
0     3.0       0.0    0   NaN    0.0    0.0   7.750
1     2.0       0.0    1  39.0    0.0    0.0  26.000
2     2.0       1.0    0  40.0    0.0    0.0  13.000
3     3.0       1.0    0  31.0    1.0    1.0  20.525
4     3.0       1.0    0   NaN    2.0    0.0  23.250

In [112]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   int64
 3   age       812 non-null    float64
 4   sibsp     1009 non-null   float64
 5   parch     1009 non-null   float64
 6   fare      1008 non-null   float64
dtypes: float64(6), int64(1)
memory usage: 55.3 KB

In [113]:
data_clean = data_clean.fillna(data_clean["age"].mean())
dftest = dftest.fillna(dftest["age"].mean())

In [114]:
# Imputer --> Sklearn!

In [115]:
data_clean.loc[1]

pclass       2.0
survived     0.0
sex          1.0
age         39.0
sibsp        0.0
parch        0.0
fare        26.0
Name: 1, dtype: float64

In [126]:
dftest.head(n=20)

    pclass  sex        age  sibsp  parch     fare
0      1.0    1  36.000000    0.0    0.0  26.3875
1      3.0    0  30.027422    8.0    2.0  69.5500
2      1.0    1  30.027422    0.0    0.0  50.0000
3      2.0    1  34.000000    0.0    0.0  13.0000
4      2.0    1  28.000000    0.0    0.0  13.0000
5      2.0    0  31.000000    1.0    1.0  26.2500
6      1.0    1  40.000000    0.0    0.0  27.7208
7      3.0    1  30.027422    0.0    0.0   7.2292
8      3.0    1  22.000000    0.0    0.0   8.0500
9      1.0    1  30.000000    0.0    0.0  45.5000
10     3.0    1  30.027422    0.0    0.0   7.2250
11     3.0    1  30.027422    1.0    0.0  24.1500
12     1.0    1  31.000000    0.0    0.0  28.5375
13     3.0    1  30.027422    0.0    0.0   8.0500
14     2.0    0  19.000000    1.0    0.0  26.0000
15     3.0    1  30.027422    0.0    0.0   7.5500
16     3.0    1  30.027422    1.0    0.0   7.7500
17     2.0    0  34.000000    0.0    0.0  10.5000
18     3.0    0  30.027422    0.0    0.0   7.8792
19     2.0    1  16.000000    0.0    0.0  10.5000

In [117]:
input_cols = ['pclass',"sex","age","sibsp","parch","fare"]
output_cols = ["survived"]

X = data_clean[input_cols]
Y = data_clean[output_cols]

print(X.shape,Y.shape)
print(type(X))

(1009, 6) (1009, 1)
<class 'pandas.core.frame.DataFrame'>

### Train-Validation-Test Set Split

In [118]:
split = int(0.7*data_clean.shape[0])
train_data = data_clean[:split]
test_data = data_clean[split:]
test_data = test_data.reset_index(drop=True)

In [119]:
print(train_data.shape,test_data.shape)

(706, 7) (303, 7)

## Decision Tree using Sklearn

In [120]:
from sklearn.tree import DecisionTreeClassifier

In [121]:
sk_tree = DecisionTreeClassifier(criterion='entropy',max_depth=5)

In [122]:
sk_tree.fit(train_data[input_cols],train_data[output_cols])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='entropy',
                       max_depth=5, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [123]:
sk_tree.predict(test_data[input_cols])

array([0., 1., 0., 0., 0., 0., 1., 1., 0., 0., 0., 0., 1., 0., 0., 0., 1.,
       0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 1., 1., 0., 1., 0., 0.,
       0., 0., 1., 1., 0., 1., 1., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 1., 0., 1., 1., 0., 0., 0., 0., 0., 1., 1., 0., 0., 0.,
       0., 0., 1., 0., 0., 0., 1., 1., 1., 0., 0., 1., 1., 0., 0., 0., 0.,
       0., 0., 0., 0., 1., 1., 0., 1., 0., 0., 0., 0., 1., 1., 0., 0., 1.,
       0., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0.,
       1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0.,
       0., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0.,
       1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 1., 1., 0., 0., 1., 1., 0., 1., 1., 1., 0., 0., 1., 1., 0., 0.,
       0., 1., 0., 0., 0., 1., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0., 1.,
       0., 1., 1., 1., 1., 0., 0., 0., 0., 1., 0., 0., 0., 1., 1., 0., 1.,
       0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.,
       1., 1., 0., 1., 1., 1., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 1., 0., 1., 0., 1., 0., 0., 1., 1., 1.,
       1., 0., 0., 1., 0., 0., 1., 1., 0., 1., 0., 1., 0., 1., 1., 1., 0.,
       1., 0., 0., 1., 1., 1., 0., 1., 0., 0., 0., 1., 0., 0.])

In [124]:
sk_tree.score(test_data[input_cols],test_data[output_cols])

0.7722772277227723

In [127]:
ypred=sk_tree.predict(dftest)

In [130]:
df_=pd.DataFrame(ypred,columns=['survived'])

In [131]:
df_.head()

   survived
0       0.0
1       0.0
2       0.0
3       0.0
4       0.0

In [132]:
df_.to_csv('titanic_chall.csv')